app/Controllers/Home.php

    public function post_kehadiran()
    {
        $data = [
            'nama' => $_POST['nama'],
            'konfirmasi' => $_POST['konfirmasi_kehadiran'],
        ];
        $insert_data =  $this->db->table('konfirmasi_kehadiran')->insert($data);
---
INSERT INTO `konfirmasi_kehadiran` (`nama`, `pesan`, `konfirmasi`) VALUES ('Muhamad Abdul Mufidz', 'asdasd', 'Akan Hadir')

    public function post_ucapan()
    {
        $data = [
            'nama' => $_POST['nama'],
            'ucapan' => $_POST['ucapan'],
        ];
        $insert_data =  $this->db->table('ucapan')->insert($data);
---
INSERT INTO `ucapan` (`nama`, `ucapan`) VALUES ('FACHRIZAL ISNANDAR', 'Selamaaaattttt')

    public function get_ucapan()
    {
        $ucapan =  $this->db->table('ucapan')->select("*")->where("deleted_at is null")->orderBy("id", "DESC")->get()->getResultArray();
---
SELECT *
FROM `ucapan`
WHERE `deleted_at` is null
ORDER BY `id` DESC